## mesazon-clusters-dev
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.gateway_pg_cluster.data.digitalocean_project.project: Reading...
module.gateway_pg_cluster.data.digitalocean_project.project: Read complete after 0s [id=5d792a15-cf5f-46c7-ab46-425f64c52ea4]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # digitalocean_database_firewall.pg_firewall_configure will be destroyed
  # (because digitalocean_database_firewall.pg_firewall_configure is not in configuration)
  - resource "digitalocean_database_firewall" "pg_firewall_configure" {
      - cluster_id = "b9aa5c38-483f-4f84-b550-6b145f60f4d7" -> null
      - id         = "b9aa5c38-483f-4f84-b550-6b145f60f4d7-20260207001054077800000001" -> null

      - rule {
          - created_at = "2026-02-07T00:12:38Z" -> null
          - type       = "ip_addr" -> null
          - uuid       = "80088a6d-7d26-4201-8e68-ea379ee55576" -> null
          - value      = "172.184.211.85" -> null
        }
    }

  # module.gateway_pg_configure.digitalocean_database_firewall.pg_firewall_configure will be created
  + resource "digitalocean_database_firewall" "pg_firewall_configure" {
      + cluster_id = "b9aa5c38-483f-4f84-b550-6b145f60f4d7"
      + id         = (known after apply)

      + rule {
          + created_at = (known after apply)
          + type       = "ip_addr"
          + uuid       = (known after apply)
          + value      = "4.236.173.162"
        }
    }

  # module.gateway_pg_configure.postgresql_default_privileges.flyway_sequences_to_user[0] has moved to module.gateway_pg_configure.postgresql_default_privileges.flyway_sequences_to_user
    resource "postgresql_default_privileges" "flyway_sequences_to_user" {
        id                = "gateway_group_fra1_dev_gateway_db_fra1_dev_gateway_schema_fra1_dev_gateway_flyway_user_fra1_dev_sequence"
        # (7 unchanged attributes hidden)
    }

  # module.gateway_pg_configure.postgresql_default_privileges.flyway_tables_to_user[0] has moved to module.gateway_pg_configure.postgresql_default_privileges.flyway_tables_to_user
    resource "postgresql_default_privileges" "flyway_tables_to_user" {
        id                = "gateway_group_fra1_dev_gateway_db_fra1_dev_gateway_schema_fra1_dev_gateway_flyway_user_fra1_dev_table"
        # (7 unchanged attributes hidden)
    }

  # module.gateway_pg_configure.postgresql_grant.flyway_provided_schema_usage[0] has moved to module.gateway_pg_configure.postgresql_grant.flyway_provided_schema_usage
    resource "postgresql_grant" "flyway_provided_schema_usage" {
        id                = "gateway_flyway_group_fra1_dev_gateway_db_fra1_dev_gateway_schema_fra1_dev_schema"
        # (6 unchanged attributes hidden)
    }

  # module.gateway_pg_configure.postgresql_grant.flyway_public_schema_usage[0] has moved to module.gateway_pg_configure.postgresql_grant.flyway_public_schema_usage
    resource "postgresql_grant" "flyway_public_schema_usage" {
        id                = "gateway_flyway_group_fra1_dev_gateway_db_fra1_dev_public_schema"
        # (6 unchanged attributes hidden)
    }

  # module.gateway_pg_configure.postgresql_grant.user_provided_schema_usage[0] has moved to module.gateway_pg_configure.postgresql_grant.user_provided_schema_usage
    resource "postgresql_grant" "user_provided_schema_usage" {
        id                = "gateway_group_fra1_dev_gateway_db_fra1_dev_gateway_schema_fra1_dev_schema"
        # (6 unchanged attributes hidden)
    }

  # module.gateway_pg_configure.postgresql_grant_role.flyway_assignment[0] has moved to module.gateway_pg_configure.postgresql_grant_role.flyway_assignment
    resource "postgresql_grant_role" "flyway_assignment" {
        id                = "gateway_flyway_user_fra1_dev_gateway_flyway_group_fra1_dev_false"
        # (3 unchanged attributes hidden)
    }

  # module.gateway_pg_configure.postgresql_grant_role.user_assignment[0] has moved to module.gateway_pg_configure.postgresql_grant_role.user_assignment
    resource "postgresql_grant_role" "user_assignment" {
        id                = "gateway_user_fra1_dev_gateway_group_fra1_dev_false"
        # (3 unchanged attributes hidden)
    }

  # module.gateway_pg_configure.postgresql_role.flyway_group[0] has moved to module.gateway_pg_configure.postgresql_role.flyway_group
    resource "postgresql_role" "flyway_group" {
        id                                  = "gateway_flyway_group_fra1_dev"
        name                                = "gateway_flyway_group_fra1_dev"
        # (16 unchanged attributes hidden)
    }

  # module.gateway_pg_configure.postgresql_role.user_group[0] has moved to module.gateway_pg_configure.postgresql_role.user_group
    resource "postgresql_role" "user_group" {
        id                                  = "gateway_group_fra1_dev"
        name                                = "gateway_group_fra1_dev"
        # (16 unchanged attributes hidden)
    }

  # module.gateway_pg_configure.postgresql_schema.database_schema[0] has moved to module.gateway_pg_configure.postgresql_schema.database_schema
    resource "postgresql_schema" "database_schema" {
        id            = "gateway_db_fra1_dev.gateway_schema_fra1_dev"
        name          = "gateway_schema_fra1_dev"
        # (4 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>